# Задание 1

Датасет для домашнего задания вы найдете в разделе “Материалы к домашнему заданию” к этому занятию.
Определите, какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import pandas as pd

In [44]:
movies_df = pd.read_csv('movies.csv')
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [45]:
ratings_df = pd.read_csv('ratings.csv')
ratings_df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [46]:
merged_df = pd.merge(movies_df, ratings_df, on='movieId')

In [47]:
merged_df.tail()

,movieId,title,genres,userId,rating,timestamp
100831,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy,184,4.0,1537109082
100832,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy,184,3.5,1537109545
100833,193585,Flint (2017),Drama,184,3.5,1537109805
100834,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation,184,3.5,1537110021
100835,193609,Andrew Dice Clay: Dice Rules (1991),Comedy,331,4.0,1537157606

In [48]:
merged_df = merged_df.loc[(merged_df['rating'] == 5.0)].reset_index()

In [53]:
five_rated_films = merged_df.groupby('title')['rating'].count().reset_index()

In [54]:
five_rated_films['rating'].max()

153

In [56]:
five_rated_films = five_rated_films.loc[(five_rated_films['rating'] == 153)].reset_index()

In [57]:
five_rated_films.head()

   index                             title  rating
0   2310  Shawshank Redemption, The (1994)     153

In [60]:
best_movie = five_rated_films.loc[0, 'title']

'Shawshank Redemption, The (1994)'

In [59]:
print(best_movie)

Shawshank Redemption, The (1994)

# Задание 2

По данным файла power.csv (находится в “Материалы к домашнему заданию”) посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 год. Не учитывайте в расчётах отрицательные значения quantity.

In [61]:
power_df = pd.read_csv('power.csv')
power_df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [65]:
pribaltika_df = power_df[
    (
        (power_df['country'] == 'Estonia') | 
        (power_df['country'] == 'Latvia') | 
        (power_df['country'] == 'Lithuania')
    ) & 
    (
        (power_df['category'] == 4) | 
        (power_df['category'] == 12) | 
        (power_df['category'] == 21)
    ) & 
    (power_df['year'] >= 2005) &
    (power_df['year'] <= 2010) &
    (power_df['quantity'] >= 0)
]

In [67]:
energy_sum = pribaltika_df['quantity'].sum()

In [68]:
print(energy_sum)

240580.0